# MYSQL Database Creation
Name: Michael McCann <br>
Last Updated: 08 MAY 2022

## Imports

In [1]:
import pandas as pd
import numpy as np
import json

import pymysql
from sqlalchemy import create_engine
from sqlalchemy.types import*
from sqlalchemy_utils import create_database, database_exists

# Create Database

In [2]:
# Load SQL creds
with open('../../.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['user', 'password'])

## Create Connection to MYSQL

In [3]:
# create connection
database = "movieDB"
conn = f"mysql+pymysql://{login['user']}:{login['password']}@localhost/{database}"

# create engine
engine = create_engine(conn)

## Create Database

In [4]:
# Create Database (and check to make sure you don't overwrite)
if database_exists(conn) == False:
    create_database(conn)
else:
    print('the database already exists')

the database already exists

# Create SQL Tables

## title_basics

### Read In and Inspect Data

In [5]:
basics = pd.read_csv("data/title_basics.csv.gz")

display(basics.head(2))

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama

In [6]:
basics['genres_split'] = basics['genres'].str.split(',')
basics.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]

### Normalize Genres Column

In [7]:
genres_split = basics['genres'].str.split(',')
unique_genres = sorted(genres_split.explode().unique())

In [8]:
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [9]:
# Save out exploded_genres to create title_genre later
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
79183,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Action
79183,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Adventure
79183,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Thriller
79184,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
79184,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History

In [10]:
# Clean extra columns (and repeat genre columns) from basics
basics = basics.drop(columns = ['originalTitle', 'isAdult', 'titleType', 'genres', 'genres_split'])

### Create Table

In [11]:
# Check Datatypes for Schema
basics.dtypes

tconst             object
primaryTitle       object
startYear           int64
endYear           float64
runtimeMinutes      int64
dtype: object

In [12]:
# Find length of object types
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()

# Create schema
basics_schema = {
    "tconst": String(key_len+1),
    "primaryTitle": Text(title_len+1),
    "startYear":Float(),
    "endYear":Float(),
    "runtimeMinutes": Integer()}

In [13]:
# Create title_basics table
basics.to_sql('title_basics', engine, dtype=basics_schema,
              if_exists = 'replace', index = False)

In [14]:
# Set Primary Key
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [15]:
# Check table
q = '''
SELECT *
FROM title_basics
LIMIT 5; '''
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
2,tt0069049,The Other Side of the Wind,2018.0,None,122
3,tt0088751,The Naked Monster,2005.0,None,100
4,tt0093119,Grizzly II: Revenge,2020.0,None,74

## title_ratings

### Read In and Inspect Data

In [16]:
ratings = pd.read_csv("data/title_ratings.csv.gz")

display(ratings.head(2))

      tconst  averageRating  numVotes
0  tt0000001            5.7      1874
1  tt0000002            5.9       248

In [17]:
# Check Datatypes for Schema
ratings.dtypes

tconst            object
averageRating    float64
numVotes           int64
dtype: object

### Create Table

In [18]:
# Find length of object types
key_len = basics['tconst'].fillna('').map(len).max()

# Create Schema
ratings_schema = {
    "tconst": String(key_len+1),
    "averageRating":Float(),
    "numVotes": Integer()}

In [19]:
# Create title_ratings table
ratings.to_sql('title_ratings', engine, dtype=ratings_schema,
               if_exists='replace', index=False)

In [20]:
# Set Primary Key
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [21]:
# Check table
q = '''
SELECT *
FROM title_ratings
LIMIT 5; '''
pd.read_sql(q,engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1874
1  tt0000002            5.9       248
2  tt0000003            6.5      1647
3  tt0000004            5.8       160
4  tt0000005            6.2      2475

## title_genres

In [22]:
# Use exploded_genres generated earlier to create cross table
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres.drop(columns = 'genres_split', inplace = True)
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

### Create Table

In [23]:
# Check Datatypes for Schema
title_genres.dtypes

tconst      object
genre_id     int64
dtype: object

In [24]:
# Find length of object types
key_len = title_genres['tconst'].fillna('').map(len).max()

# Create Schema
title_genres_schema = {
    "tconst": String(key_len+1),
    "genre_id": Integer(), 
}

In [25]:
# Create title_genres table
title_genres.to_sql('title_genres', engine, dtype=title_genres_schema,
                   if_exists='replace', index=False)

In [26]:
# Check table
q = '''
SELECT *
FROM title_genres
LIMIT 5; '''
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

## genres

### Create DataFrame

In [27]:
# Turn mapping dictionary into a Dataframe
genres = pd.DataFrame({'Genre_Name': genre_map.keys(), 'Genre_ID': genre_map.values()})
genres.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [28]:
# rename columns to match other tables
genres = genres.rename(columns = {'Genre_ID':'genre_id', 'Genre_Name': 'genre_name'})

### Create Table

In [29]:
# Check Datatypes for Schema
genres.dtypes

genre_name    object
genre_id       int64
dtype: object

In [30]:
# Find length of object types
name_len = genres['genre_name'].fillna('').map(len).max()

# Create Schema
genres_schema = {
    "genre_name": Text(name_len+1),
    "genre_id": Integer() }

In [31]:
# Create genres table
genres.to_sql('genres', engine, dtype=genres_schema,
              if_exists='replace', index=False)

In [32]:
# Set Primary Key
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`)')

In [33]:
# Check table
q = '''
SELECT *
FROM genres
LIMIT 5; '''
pd.read_sql(q,engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

## tmdb_data

### Read In and Inspect Data

In [34]:
tmdb_merged = pd.read_csv('data/tmdb_merged.csv.gz')

tmdb_merged.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.4,21.0,NaN
1,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,4.4,7.0,NaN
2,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,0.0,0.0,NaN
3,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",http://www.wkw-inthemoodforlove.com/,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.1,1860.0,PG
4,tt0118852,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}]",NaN,49511.0,en,Chinese Coffee,...,0.0,99.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,There's a fine line between friendship and bet...,Chinese Coffee,0.0,6.9,45.0,R

In [35]:
# Grab columns we want for the database
tmdb_data = tmdb_merged[['imdb_id', 'revenue', 'budget', 'certification']]

# change imdb_id to tconst to match the other tables
tmdb_data = tmdb_data.rename(columns = {'imdb_id':'tconst'})

### Create Table

In [36]:
# Check Datatypes for Schema
tmdb_data.dtypes

tconst            object
revenue          float64
budget           float64
certification     object
dtype: object

In [37]:
# Find length of object types
key_len = tmdb_data['tconst'].fillna('').map(len).max()
cert_len = tmdb_data['certification'].fillna('').map(len).max()

# Create Schema
tmdb_schema = {
    'tconst': String(key_len+1),
    'revenue': Float(),
    'budget': Float(),
    'certification': Text(key_len+1)}

In [38]:
# Create tmdb_table
tmdb_data.to_sql('tmdb_data', engine, dtype=tmdb_schema,
                 if_exists='replace', index=False)

In [39]:
# Set Primary Key
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`tconst`);')

In [40]:
# Check table
q = '''
SELECT *
FROM tmdb_data
LIMIT 5; '''
pd.read_sql(q,engine)

      tconst     revenue      budget certification
0  tt0035423  76019000.0  48000000.0         PG-13
1  tt0062336         0.0         0.0          None
2  tt0069049         0.0  12000000.0             R
3  tt0088751         0.0    350000.0          None
4  tt0093119         0.0   7500000.0          None

# Tables Check

In [41]:
# Check that all 5 tables have been loaded in properly
q = ''' SHOW TABLES'''

pd.read_sql(q,engine)

  Tables_in_moviedb
0            genres
1      title_basics
2      title_genres
3     title_ratings
4         tmdb_data